movie_upload_page/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "description", "director_name", "language", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "s"], ["description", "s"], ["director_name", "s"], ["language", "s"], ["created_at", "2023-01-11 08:40:28.031801"], ["updated_at", "2023-01-11 08:40:28.031801"]]